# Data Transformation
In this guide, we discuss how to do `Data Transformation` in `Pandas`.

<hr style="border:2px solid gray"> </hr>.

In [2]:
#Load the libraries
import pandas as pd
import numpy as np

from functools import reduce
from numpy import random

# 1. Function Application and Mapping

In [3]:
#Create a new dataframe
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [4]:
#View the dataframe
frame

               b         d         e
Utah    1.345037  0.078794 -0.016984
Ohio    0.294078 -0.228768 -0.254728
Texas   0.634022 -1.570031 -0.479689
Oregon -0.533985 -0.300016 -1.378395

**4.1 Apply a function to the entire dataframe**

In [5]:
#Apply a function to the entire dataframe
np.abs(frame)

               b         d         e
Utah    1.345037  0.078794  0.016984
Ohio    0.294078  0.228768  0.254728
Texas   0.634022  1.570031  0.479689
Oregon  0.533985  0.300016  1.378395

Another frequent operation is applying a `function on one-dimensional arrays to each column or row`. 
DataFrame’s apply method does exactly this:

In [6]:
#Create a function
f = lambda x: x.max() - x.min()

In [7]:
#Apply the function to entire dataframe
frame.apply(f)

b    1.879022
d    1.648825
e    1.361411
dtype: float64

Here the `function f`, which computes the difference between the maximum and minimum of a Series, is `invoked once on each column in frame`. The result is a Series having the columns of frame as its index.

In [8]:
#If you pass axis='columns' to apply, the function will be invoked once per row instead:
frame.apply(f, axis='columns')

Utah      1.362021
Ohio      0.548806
Texas     2.204053
Oregon    1.078379
dtype: float64

**4.2 Create a function to calculate min/max in each column**

In [9]:
#Create the function
def f(x):
    return pd.Series([x.max(), x.min()], index = ["max","min"])

In [10]:
#Apply the function
frame.apply(f)

            b         d         e
max  1.345037  0.078794 -0.016984
min -0.533985 -1.570031 -1.378395

In [11]:
#Apply the function to selected columns
frame[["b","d"]].apply(f)

            b         d
max  1.345037  0.078794
min -0.533985 -1.570031

In [12]:
frame

               b         d         e
Utah    1.345037  0.078794 -0.016984
Ohio    0.294078 -0.228768 -0.254728
Texas   0.634022 -1.570031 -0.479689
Oregon -0.533985 -0.300016 -1.378395

**4.3 Applying map, filter and reduce on a Dataframe column**

In [13]:
#map function on a dataframe column
frame['b'] = frame['b'].map(lambda x: 2*x)
frame['b']

Utah      2.690074
Ohio      0.588156
Texas     1.268043
Oregon   -1.067970
Name: b, dtype: float64

In [14]:
frame['b'].values

array([ 2.69007419,  0.58815563,  1.2680434 , -1.06796998])

In [15]:
#filter function on a dataframe column
list(filter(lambda x: x > 0, frame['b'].values))

[2.690074190654088, 0.5881556273774997, 1.2680434037374968]

In [16]:
#reduce function on a dataframe column
total_sum = reduce(lambda x, y: x+y, frame['b'])

In [17]:
print(total_sum)

3.478303246314712

In [18]:
#View the dataframe
frame

               b         d         e
Utah    2.690074  0.078794 -0.016984
Ohio    0.588156 -0.228768 -0.254728
Texas   1.268043 -1.570031 -0.479689
Oregon -1.067970 -0.300016 -1.378395

<hr style="border:2px solid gray"> </hr>.

# 2. Sorting and Ranking
`Sorting` a dataset by some criterion is another important built-in operation. To sort lexicographically by row or column index, use the `sort_index` method, which returns a new, sorted object:

**5.1 Sort a Pandas Series**

In [19]:
#Create a Pandas series
obj = pd.Series(range(4), index=['d','a','b','c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [20]:
#Sort via index
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

**5.2 Sort a Pandas DataFrame**

**Sort via index**

In [21]:
#Create a DataFrame
frame = pd.DataFrame(random.randint(100, size=(2, 4)), index=['three','one'], columns=['d','a','b','c'])

In [22]:
#Sort via index
frame.sort_index()

        d   a   b   c
one    14  80  63  91
three  90  33  69  54

In [23]:
#Sort via columns
frame.sort_index(axis=1)

        a   b   c   d
three  33  69  54  90
one    80  63  91  14

The data is sorted in `ascending order` by `default`, but can be sorted in descending order, too:

In [24]:
frame.sort_index(axis=1, ascending=False)

        d   c   b   a
three  90  54  69  33
one    14  91  63  80

**Sort via values**

In [25]:
#Sort a Pandas Series
obj = pd.Series([9,4,2,7,1])
obj.sort_values()

4    1
2    2
1    4
3    7
0    9
dtype: int64

In [26]:
#Sort a DataFrame
#Create a DataFrame
frame = pd.DataFrame(random.randint(100, size=(2,4)), index=['three','one'], columns=['d','a','b','c'])
frame.sort_values(by=['a','b'])

        d   a   b   c
three  56  24  41  39
one    17  48  70  89

<hr style="border:2px solid gray"> </hr>.

# 3. Reindex

**Reindexing**<br>
Calling `reindex` on this Series rearranges the data according to the new index, introducing `missing values` if any `index values were not already present`:

In [27]:
#Create a new object
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [28]:
#Reindexing the old series
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [29]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

-------

**Another example of Reindexing**

In [30]:
#Create a new object obj3
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [31]:
#View the series object
obj3

0      blue
2    purple
4    yellow
dtype: object

In [32]:
#Reindex the series with method ffill
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

--------

**Reindexing a Dataframe**

In [33]:
#Create a new dataframe
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])

In [34]:
#Reindex
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [35]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [36]:
#Reindex the columns
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [37]:
#Reindex both rows and columns
frame.reindex(['a', 'b', 'c', 'd'], columns = states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

<hr style="border:2px solid gray"> </hr>.

# 4. Data Mapping

In [38]:
#Create a sample dataframe
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 
                              'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [39]:
#View the dataframe
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

Suppose you wanted to `add a column` indicating the `type of animal` that `each food came from`. 
Let’s write down a mapping of each distinct meat type to the kind of animal:

In [40]:
#meat to animal mapping
meat_to_animal = {
      'bacon': 'pig',
      'pulled pork': 'pig',
      'pastrami': 'cow',
      'corned beef': 'cow',
      'honey ham': 'pig',
      'nova lox': 'salmon'
}

In [41]:
#Create a lowercase column for food
lowercased = data['food'].str.lower()

In [42]:
#Map food to animal in a new column
data['animal'] = lowercased.map(meat_to_animal)

In [43]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

<hr style="border:2px solid gray"> </hr>.

# 5. Renaming Axis Indexes
Like values in a `Series`, `axis labels` can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects. You can also modify the axes in-place without creating a new data structure.

In [44]:
#Create the dataframe
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])

In [45]:
#Create the transform function
transform = lambda x: x[:4].upper()

In [46]:
#Map the index via transform
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
#You can assign to index, modifying the DataFrame in-place:
data.index = data.index.map(transform)

If you want to create a transformed version of a dataset without modifying the original, a useful method is `rename`:

In [48]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [49]:
#Notably, rename can be used in conjunction with a dict-like object providing new values for a subset of the axis labels:
data.rename(index={'OHIO': 'INDIANA'}, columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [50]:
#rename saves you from the chore of copying the DataFrame manually and 
#assigning to its index and columns attributes. Should you wish to modify a dataset in-place, pass inplace=True:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

<hr style="border:2px solid gray"> </hr>.

# 6. Discretization and Binning

Continuous data is often discretized or otherwise separated into “bins” for analysis. 
Suppose you have data about a group of people in a study, and you want to group them into discrete age buckets:

In [51]:
#Ages of people
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

Let’s divide these into `bins` of 18 to 25, 26 to 35, 36 to 60, and finally 61 and older. To
do so, you have to use `cut`, a function in pandas:

In [52]:
#Bins of age groups
bins = [18, 25, 35, 60, 100]

In [53]:
cats = pd.cut(ages, bins)

In [54]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

The object pandas returns is a `special Categorical object`. The `output` you see describes the `bins computed by pandas.cut`. You can treat it like an array of strings indicating the bin name; internally it contains a categories array specifying the distinct category names along with a labeling for the ages data in the codes attribute:

In [55]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [56]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [57]:
#Note that pd.value_counts(cats) are the bin counts for the result of pandas.cut.
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

If you pass an integer number of bins to cut instead of explicit bin edges, it will compute equal-length bins based on the minimum and maximum values in the data. Consider the case of some uniformly distributed data chopped into fourths:

In [58]:
data = np.random.rand(20)

In [59]:
data = pd.cut(data, 4, precision=2)

In [60]:
pd.value_counts(data)

(0.066, 0.3]    8
(0.3, 0.52]     5
(0.75, 0.98]    4
(0.52, 0.75]    3
dtype: int64

A closely related function, `qcut`, bins the data based on sample quantiles. Depending on the distribution of the data, using cut will not usually result in each bin having the same number of data points. Since qcut uses sample quantiles instead, by definition you will obtain roughly equal-size bins:

In [61]:
data = np.random.randn(1000)

In [62]:
cats = pd.qcut(data, 4)

In [63]:
pd.value_counts(cats)

(0.645, 4.117]      250
(-0.034, 0.645]     250
(-0.715, -0.034]    250
(-3.066, -0.715]    250
dtype: int64

In [64]:
#Similar to cut you can pass your own quantiles (numbers between 0 and 1, inclusive):
data_cut = pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

In [65]:
pd.value_counts(data_cut)

(-0.034, 1.24]      400
(-1.336, -0.034]    400
(1.24, 4.117]       100
(-3.066, -1.336]    100
dtype: int64

<hr style="border:2px solid gray"> </hr>.

# 7. Outlier Treatment
Filtering or transforming outliers is largely a matter of applying array operations. Consider a DataFrame with some normally distributed data:

In [66]:
#Create a dataframe
data = pd.DataFrame(np.random.randn(1000, 4))

In [67]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.008996    -0.020559     0.019336    -0.014898
std       0.997723     1.052861     0.992671     0.992997
min      -3.400155    -4.081978    -2.911119    -3.062229
25%      -0.672006    -0.715303    -0.650586    -0.669412
50%      -0.019674    -0.026806     0.005565     0.012431
75%       0.673301     0.673541     0.659052     0.670671
max       3.252906     3.152308     3.135087     3.048671

Suppose you wanted to find values in one of the columns exceeding 3 in absolute value:

In [68]:
#Select the data in 2nd column name
col = data[2]

In [70]:
col[np.abs(col) > 3]

815    3.084838
829    3.135087
Name: 2, dtype: float64

In [71]:
#To select all rows having a value exceeding 3 or –3, you can use the any method on a boolean DataFrame:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
188 -0.100459  3.152308 -0.349028 -0.068964
205 -0.704072  0.567768 -0.605173  3.048671
314 -3.400155 -1.468432 -0.826091  0.213479
333 -0.342731 -3.333545  1.580914  0.232367
342  3.252906  0.049925 -0.411357 -0.664075
433 -1.069148 -0.678677 -0.781117 -3.062229
529 -0.952151 -4.081978 -1.136668  0.588122
815  1.082062  2.055664  3.084838 -0.109069
829 -0.392606 -0.665792  3.135087  0.227017
895 -1.085615  3.008124  0.086169  0.948440
948 -3.270106 -2.179167 -1.930651 -0.888418

<hr style="border:2px solid gray"> </hr>.

# 8. Dummy Variables
Another type of transformation for statistical modeling or machine learning applica‐ tions is converting a categorical variable into a “dummy” or “indicator” matrix. If a column in a DataFrame has k distinct values, you would derive a matrix or Data‐ Frame with k columns containing all 1s and 0s. pandas has a get_dummies function for doing this, though devising one yourself is not difficult. Let’s return to an earlier example DataFrame:

In [73]:
#Create the dataframe
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [74]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [75]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [78]:
#In some cases, you may want to add a prefix to the columns in the indicator DataFrame, 
#which can then be merged with the other data. get_dummies has a prefix argu‐ ment for doing this:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [80]:
#Join dummies to original dataframe
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

<hr style="border:2px solid gray"> </hr>.

# End of sheet